; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v1 ?v13)
             (pred_6 ?v5 ?v4)
             (pred_4 ?v1 ?v4)
             (pred_12 ?v8 ?v1 )
	     (pred_8 ?v1)
             (pred_10 ?v7)
             (pred_7 ?v5)
             (pred_2 ?v4)
             (pred_3 ?v1)
             (pred_9 ?v5)
             (pred_1 ?v1)
             (pred_11 ))



(:action op_1
:parameters (?v12 ?v9 ?v2 ?v6)
:precondition (and (pred_10 ?v12) (pred_10 ?v9) (pred_7 ?v2) (pred_2 ?v6)
          (pred_5 ?v12 ?v9) (pred_6 ?v2 ?v6)
                   (pred_4 ?v9 ?v6) (pred_8 ?v12) 
                   (pred_3 ?v9) (pred_9 ?v2))
:effect (and  (pred_1 ?v9) (not (pred_3 ?v9))))


(:action op_2
:parameters (?v12 ?v10)
:precondition (and (pred_10 ?v12) (pred_10 ?v10)
               (pred_8 ?v12) (pred_5 ?v12 ?v10) (pred_1 ?v10))
:effect (and (pred_8 ?v10) (not (pred_8 ?v12))))

(:action op_5
:parameters (?v12 ?v2)
:precondition (and (pred_10 ?v12) (pred_7 ?v2) 
                  (pred_8 ?v12) (pred_12 ?v2 ?v12) (pred_11 ))
:effect (and (pred_9 ?v2)
   (not (pred_12 ?v2 ?v12)) (not (pred_11 ))))


(:action op_3
:parameters (?v12 ?v11 ?v3)
:precondition (and (pred_10 ?v12) (pred_7 ?v11) (pred_7 ?v3)
                  (pred_8 ?v12) (pred_9 ?v3) (pred_12 ?v11 ?v12))
:effect (and (pred_9 ?v11) (pred_12 ?v3 ?v12)
        (not (pred_9 ?v3)) (not (pred_12 ?v11 ?v12))))

(:action op_4
:parameters (?v12 ?v2)
:precondition (and (pred_10 ?v12) (pred_7 ?v2) 
                  (pred_8 ?v12) (pred_9 ?v2))
:effect (and (pred_11 ) (pred_12 ?v2 ?v12) (not (pred_9 ?v2)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_15 obj_07 obj_02 obj_20 obj_03 obj_12 obj_17 obj_16 obj_19 obj_09 obj_06 obj_11 obj_04 obj_18 obj_13
    obj_05 obj_14
    obj_01 obj_08
    )

    (:init
       (pred_11)

       (pred_10 obj_10)
       (pred_10 obj_15)
       (pred_10 obj_07)
       (pred_10 obj_02)
       (pred_10 obj_20)
       (pred_10 obj_03)
       (pred_10 obj_12)
       (pred_10 obj_17)
       (pred_10 obj_16)
       (pred_10 obj_19)
       (pred_10 obj_09)
       (pred_10 obj_06)
       (pred_10 obj_11)
       (pred_10 obj_04)
       (pred_10 obj_18)
       (pred_10 obj_13)
       (pred_2 obj_05)
       (pred_2 obj_14)
       (pred_7 obj_01)
       (pred_7 obj_08)

       (pred_5 obj_10 obj_20)
       (pred_5 obj_10 obj_15)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_15 obj_07)
       (pred_5 obj_15 obj_10)
       (pred_5 obj_07 obj_12)
       (pred_5 obj_07 obj_02)
       (pred_5 obj_07 obj_15)
       (pred_5 obj_02 obj_17)
       (pred_5 obj_02 obj_07)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_20 obj_03)
       (pred_5 obj_20 obj_10)
       (pred_5 obj_03 obj_19)
       (pred_5 obj_03 obj_12)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_03 obj_20)
       (pred_5 obj_12 obj_09)
       (pred_5 obj_12 obj_17)
       (pred_5 obj_12 obj_07)
       (pred_5 obj_12 obj_03)
       (pred_5 obj_17 obj_06)
       (pred_5 obj_17 obj_02)
       (pred_5 obj_17 obj_12)
       (pred_5 obj_16 obj_11)
       (pred_5 obj_16 obj_19)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_19 obj_04)
       (pred_5 obj_19 obj_09)
       (pred_5 obj_19 obj_03)
       (pred_5 obj_19 obj_16)
       (pred_5 obj_09 obj_18)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_09 obj_12)
       (pred_5 obj_09 obj_19)
       (pred_5 obj_06 obj_13)
       (pred_5 obj_06 obj_17)
       (pred_5 obj_06 obj_09)
       (pred_5 obj_11 obj_04)
       (pred_5 obj_11 obj_16)
       (pred_5 obj_04 obj_18)
       (pred_5 obj_04 obj_19)
       (pred_5 obj_04 obj_11)
       (pred_5 obj_18 obj_13)
       (pred_5 obj_18 obj_09)
       (pred_5 obj_18 obj_04)
       (pred_5 obj_13 obj_06)
       (pred_5 obj_13 obj_18)
       (pred_3 obj_15)
       (pred_3 obj_17)
       (pred_4  obj_15 obj_05)
       (pred_4  obj_17 obj_14)
       (pred_1 obj_10)
       (pred_1 obj_07)
       (pred_1 obj_02)
       (pred_1 obj_20)
       (pred_1 obj_03)
       (pred_1 obj_12)
       (pred_1 obj_16)
       (pred_1 obj_19)
       (pred_1 obj_09)
       (pred_1 obj_06)
       (pred_1 obj_11)
       (pred_1 obj_04)
       (pred_1 obj_18)
       (pred_1 obj_13)

       (pred_6  obj_01 obj_05)
       (pred_6  obj_08 obj_14)
       (pred_12 obj_01 obj_03)
       (pred_12 obj_08 obj_19)
       (pred_8 obj_06)
    )

    (:goal (and
       (pred_12 obj_01 obj_18)
       (pred_12 obj_08 obj_02)
    ))
(:constraints
  (always (not (pred_8 obj_09)))
)
)

; plan
1. (op_2 obj_06 obj_13)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_13)
   goals met: 0 of 2
2. (op_2 obj_13 obj_18)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_18)
   goals met: 0 of 2
3. (op_2 obj_18 obj_04)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_04)
   goals met: 0 of 2
4. (op_2 obj_04 obj_19)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_19)
   goals met: 0 of 2
5. (op_5 obj_19 obj_08)
   deleted: (pred_12 obj_08 obj_19) (pred_11)
   added: (pred_9 obj_08)
   goals met: 0 of 2
6. (op_2 obj_19 obj_03)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_03)
   goals met: 0 of 2
7. (op_2 obj_03 obj_12)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_12)
   goals met: 0 of 2
8. (op_2 obj_12 obj_07)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_07)
   goals met: 0 of 2
9. (op_2 obj_07 obj_02)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_02)
   goals met: 0 of 2
10. (op_4 obj_02 obj_08)
   deleted: (pred_9 obj_08)
   added: (pred_11) (pred_12 obj_08 obj_02)
   goals met: 1 of 2
11. (op_2 obj_02 obj_07)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_07)
   goals met: 1 of 2
12. (op_2 obj_07 obj_12)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_12)
   goals met: 1 of 2
13. (op_2 obj_12 obj_03)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_03)
   goals met: 1 of 2
14. (op_5 obj_03 obj_01)
   deleted: (pred_12 obj_01 obj_03) (pred_11)
   added: (pred_9 obj_01)
   goals met: 1 of 2
15. (op_2 obj_03 obj_19)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_19)
   goals met: 1 of 2
16. (op_2 obj_19 obj_04)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_04)
   goals met: 1 of 2
17. (op_2 obj_04 obj_18)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_18)
   goals met: 1 of 2
18. (op_4 obj_18 obj_01)
   deleted: (pred_9 obj_01)
   added: (pred_11) (pred_12 obj_01 obj_18)
   goals met: 2 of 2
